Revit 2025 API
FolderItemInfo Properties
The FolderItemInfo type exposes the following members.
Properties
Name | Description
ElementId |  The folder parameter Id
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The folder name
Top
See Also
Reference
FolderItemInfo Class
Autodesk.Revit.DB Namespace